#pragma once

#include "EXEMatrix.h"

#if defined(_GAME)
#include <mutex>
#endif

#define MONSTER_SERVER_MAX			800

#define	ATTACK_DAMAGE_MAX			100

#define UNIT_DEFAULT_LURE_DISTANCE_FAR	1638400


class EXEMesh;
class EXEModel;
class Map;

class UserData;

struct EXEModelData
{
	EXEModelData			* psUnused;

	EXEModelData			* psMotion;
	EXEModel				* pcModel;

	char					szModelName[64];
	int						iCount;

	DWORD					dwCheckSum;

	struct ModelData		* psModelData;

	DWORD					dwLastTimeUpdate;
};

struct DamageInfo
{
	EDamageTextType			iType;
	DWORD					dwTime;

	int						iValue;
	short					sParameter;
	int						iDecreaseY;
};



struct AttackDamageData
{
	int					iID;
	int					iDamage;
	int					iCounter;
};

enum EUnitDataMiscCommand : int
{
	COMMANDID_ShowSuccessAgingOrMixSkillAnimation,	//Player the skill animation effect on success mix / aging

};

enum ENPCID : int
{
	NPCID_EventGirl							= 1,
	NPCID_ItemDistributor					= 2,
	NPCID_Warehouse_DoNotUse				= 3,	//obsolete, replaced by 30 and 31
	NPCID_Force								= 4,
	NPCID_CastleControl						= 5,
	NPCID_Aging								= 6,
	NPCID_Smelting							= 7,
	NPCID_ClanControl						= 8,
	NPCID_Teleport							= 9,
	NPCID_SkillMaster						= 10,
	NPCID_Mixing							= 11,
	NPCID_Manufacturing						= 12,
	NPCID_WarpGate							= 13,
	NPCID_Bellatra							= 14,
	NPCID_ResetItem							= 15,
	NPCID_CoinShop							= 16,
	NPCID_FuryArenaNPC						= 17,
	NPCID_FuryArenaNPCEnter					= 18,
	NPCID_SocketSystemNPCDrill				= 19,
	NPCID_SocketSystemNPCStone				= 20,

	NPCID_NPCEasterEgg						= 21,

	NPCID_LarryQuests						= 22,
	NPCID_IhinEvent							= 23,
	NPCID_MarinaQuests						= 24,
	NPCID_RudolphChristmas					= 25,

	NPCID_MIXGUILD							= 26,
	NPCID_RANKLIST							= 27,
	NPCID_SOLORANKLIST						= 28,

	NPCID_Warehouse							= 30,
	NPCID_Warehouse_Seasonal				= 31,
};

enum ENPCEventCode : int
{
	NPCEVENTCODE_Force						= 200,
	NPCEVENTCODE_Smelting					= 2,
	NPCEVENTCODE_Manufacture				= 3,
	NPCEVENTCODE_ResetItem					= 4,
	NPCEVENTCODE_CoinShop					= 5,
	NPCEVENTCODE_FuryArenaNPCTeleportCT2	= 6,
	NPCEVENTCODE_FuryArenaNPCEnter			= 7,
	NPCEVENTCODE_SocketSystemNPCDrill		= 8,
	NPCEVENTCODE_SocketSystemNPCStone		= 9,
	NPCEVENTCODE_EasterNPC					= 10,
	NPCEVENTCODE_LarryQuestsNPC				= 11,
	NPCEVENTCODE_IhinEvent					= 12,
	NPCEVENTCODE_MarinaQuestsNPC			= 13,
	NPCEVENTCODE_RudolphChristmasNPC		= 14,
	NPCEVENTCODE_MixGuild					= 15,
	NPCEVENTCODE_RankList					= 16,
	NPCEVENTCODE_SoloRankList				= 17,

	NPCEVENTCODE_Warehouse					= 20,
	NPCEVENTCODE_WarehouseSeasonal			= 21,
};

//See character.h
//CHRMOTION_STATE_STAND etc
enum EAnimationType : int
{
	ANIMATIONTYPE_None					= 0x0000,	//0x00		0
	ANIMATIONTYPE_Idle					= 0x0040,	//0x40		64		CHRMOTION_STATE_STAND
	ANIMATIONTYPE_Walking				= 0x0050,	//0x50		80		CHRMOTION_STATE_WALK
	ANIMATIONTYPE_Running				= 0x0060,	//0x60		96		CHRMOTION_STATE_RUN
	ANIMATIONTYPE_Sprint				= 0x0070,	//0x70		112
	ANIMATIONTYPE_Falling				= 0x0080,	//0x80		128		CHRMOTION_STATE_FALLDOWN
	ANIMATIONTYPE_Attack				= 0x0100,	//0x100		256		CHRMOTION_STATE_ATTACK
	ANIMATIONTYPE_Flinch				= 0x0110,	//0x110		272		CHRMOTION_STATE_DAMAGE
	ANIMATIONTYPE_Die					= 0x0120,	//0x120		288		CHRMOTION_STATE_DEAD
	ANIMATIONTYPE_Potion				= 0x0140,	//0x140		320		CHRMOTION_STATE_EAT
	ANIMATIONTYPE_Skill					= 0x0150,	//0x150		336		CHRMOTION_STATE_SKILL
	ANIMATIONTYPE_FallLow				= 0x0170,	//0x170		368		CHRMOTION_STATE_FALLSTAND
	ANIMATIONTYPE_FallHigh				= 0x0180,	//0x180		384		CHRMOTION_STATE_FALLDAMAGE
	ANIMATIONTYPE_Revive				= 0x0200,	//0x200		512		CHRMOTION_STATE_RESTART
	ANIMATIONTYPE_Special				= 0x0210,	//0x210		528		CHRMOTION_STATE_WARP
	ANIMATIONTYPE_Yahoo					= 0x0220,	//0x220		544		CHRMOTION_STATE_YAHOO
	ANIMATIONTYPE_Taunt					= 0x0230,	//0x230		560
	ANIMATIONTYPE_Hammer				= 0x0300,	//0x300		768		CHRMOTION_STATE_HAMMER (For sound classification only)
};


enum EToolEquipModeTown : int
{
	TOOLEQUIPMODETOWN_None				= 0,	//Wearing Weapon as if in Battle
	TOOLEQUIPMODETOWN_Back				= 1,	//Wearing Weapon on the Back
	TOOLEQUIPMODETOWN_BackCrossBow		= 2,	//Wearing Weapon on the Back for CrossBows
	TOOLEQUIPMODETOWN_BackBow			= 3,	//Wearing Weapon on the Back for Bows
};

enum ECharacterGender
{
	CHARACTERGENDER_None,
	CHARACTERGENDER_Male,
	CHARACTERGENDER_Female,
};

enum EActionPattern : int
{
	ACTIONMODE_ClientSelf				= 0,	//Main character
	ACTIONMODE_ServerMonster			= 5,	//Monster
	ACTIONMODE_ServerNPC				= 12,	//Npc
	ACTIONMODE_ClientUnit				= 99,	//Other client unit
	ACTIONMODE_ClientTarget				= 101,
};

enum EAnimationClassFlag : unsigned int
{
	ANIMATIONCLASSFLAG_None				= 0,

	ANIMATIONCLASSFLAG_Fighter			= 0x0001,
	ANIMATIONCLASSFLAG_Mechanician		= 0x0002,
	ANIMATIONCLASSFLAG_Archer			= 0x0004,
	ANIMATIONCLASSFLAG_Pikeman			= 0x0008,
	ANIMATIONCLASSFLAG_Atalanta			= 0x0010,
	ANIMATIONCLASSFLAG_Knight			= 0x0020,
	ANIMATIONCLASSFLAG_Magician			= 0x0040,
	ANIMATIONCLASSFLAG_Priestess		= 0x0080,
	ANIMATIONCLASSFLAG_Assassin			= 0x0100,
	ANIMATIONCLASSFLAG_Shaman			= 0x0200,
};

enum EPotionStatus : int
{
	POTIONSTATUS_HP						= 1,
	POTIONSTATUS_MP						= 2,
	POTIONSTATUS_SP						= 3,
	POTIONSTATUS_HPMPSP					= 4,
	POTIONSTATUS_EtherCore				= 0x40,

};

struct PlayBuff
{
	Point3D				  sPosition;				//0x00
	int					  iFrame;					//0x0C
	short				  saAngle[4];				//0x10	//[0] = unused, [1] = player angle (y), [2] = skill param, [3] = animation id
	short				  saEquippedItems[4];		//0x18  - Mounting item number
	ID					  lTargetID;				//0x20	- Target object code
}; //Size = 0x24

struct ModelAnimation
{
	enum EMapTypeFlag : unsigned int
	{
		MAPTYPEFLAG_None = 0,
		MAPTYPEFLAG_Town = 1,
		MAPTYPEFLAG_BattleField = 2,
	};

	EAnimationType		  iType;					//0x00	State;		Valid if the status is TRUE

	int					  iKey1;					//0x04	MotionKeyWord_1
	int					  iBeginFrame;				//0x08	StartFrame
	int					  iKey2;					//0x0C	MotionKeyWord_2
	int					  iEndFrame;				//0x10	EndFrame

	int					  iaEventFrame[4];			//0x14

	int					  iItemIndexCount;			//0x24

	WORD				  eaItemIndex[52];			//0x28	ItemCodeList[MOTION_TOOL_MAX];

	EAnimationClassFlag	  eClassFlag;				//0x5C	dwJobCodeBit
	unsigned char		  uaSkill[8];				//0x60	SkillCodeList[MOTION_SKIL_MAX];

	EMapTypeFlag		  eMapTypeFlag;				//0x68 OR Flag
	BOOL				  bLoop;					//0x6C

	BYTE				  uaValue[4];				//0x70

	int					  iSubFileFrameNumber;		//0x74
}; //Size = 0x78

struct ModelAnimationOld
{
	enum EMapTypeFlag : unsigned int
	{
		MAPTYPEFLAG_None = 0,
		MAPTYPEFLAG_Town = 1,
		MAPTYPEFLAG_BattleField = 2,
	};

	EAnimationType		  iType;			//0x00

	int					  iKey1;					//0x04
	int					  iBeginFrame;				//0x08
	int					  iKey2;					//0x0C
	int					  iEndFrame;				//0x10

	int					  iaEventFrame[4];			//0x14

	int					  iItemIndexCount;			//0x24

	BYTE				  eaItemIndex[52];			//0x28

	EAnimationClassFlag	  eClassFlag;				//0x5C
	unsigned char		  uaSkill[8];				//0x60

	EMapTypeFlag		  eMapTypeFlag;				//0x68 OR Flag
	BOOL				  bLoop;					//0x6C

	BYTE				  uaValue[4];				//0x70

	int					  iSubFileFrameNumber;		//0x74
}; //Size = 0x78

struct ModelData
{
	struct MeshQuality
	{
		int				  iCount;
		char			  szMeshName1[16];
		char			  szMeshName2[16];
		char			  szMeshName3[16];
		char			  szMeshName4[16];
	};

	char				  szModelPath[64];					//ASE
	union
	{
		struct
		{
			int			  iID;
			int			  iWidth;
			int			  iHeight;
			int			  iDeathModelID;
			ModelData	* pDeathModelData;
		};

		char			  szBoneModelFilePath[64];			//ASE
	};
	char				  szDeathModelDataFilePath[64];		//INI

	MeshQuality			  sHighMeshQuality;
	MeshQuality			  sMediumMeshQuality;
	MeshQuality			  sLowMeshQuality;

	ModelAnimation		  saModelAnimation[512];
	int					  iNumModelAnimation;

	DWORD				  dwObfuscator1;
	DWORD				  dwObfuscator2;
	char				  szModelDataAnimationFile[64];		//INI

	char				  szTalkModelDataFilePath[64];		//INI
	char				  szTalkBoneModelFilePath[64];		//ASE
	ModelAnimation		  saTalkModelAnimation[30];
	unsigned int		  iTalkNumModelAnimation;

